;/****************************************Copyright (c)**************************************************
;**描        述: 允许中断嵌套时的IRQ句柄
;**              每个工程应当有独立的这个文件的拷贝，并进行相应的修改   
;********************************************************************************************************/

    INCLUDE		..\hdr\irq.inc			; 引入头文件

    CODE32

    AREA    IRQ,CODE,READONLY


;/* 以下添加中断句柄，用户根据实际情况改变 */

;/*中断*/
IRQ_Handler	HANDLER IRQ_Exception


;/*定时器0中断*/
Timer0_Handler  HANDLER Timer0_Exception

UART0_Handler	HANDLER UART0_Exception

UART1_Handler	HANDLER UART1_Exception

    END
;/*********************************************************************************************************
;**                            End Of File
;********************************************************************************************************/
